/* VM.C         (c) Copyright Roger Bowler, 2000-2009                */
/*              ESA/390 VM Diagnose calls and IUCV instruction       */

/* Interpretive Execution - (c) Copyright Jan Jaeger, 1999-2009      */

// $Id$

/*-------------------------------------------------------------------*/
/* This module implements miscellaneous diagnose functions           */
/* described in SC24-5670 VM/ESA CP Programming Services             */
/* and SC24-5855 VM/ESA CP Diagnosis Reference                       */
/* and SC24-6084 z/VM 5.4 CP Programming Services.                   */
/*      Modifications for Interpretive Execution (SIE) by Jan Jaeger */
/* z/Architecture support - (c) Copyright Jan Jaeger, 1999-2009      */
/*-------------------------------------------------------------------*/

#include "hstdinc.h"

#if !defined(_HENGINE_DLL_)
#define _HENGINE_DLL_
#endif /*_HENGINE_DLL_*/

#if !defined(_VM_C_)
#define _VM_C_
#endif /* _VM_C_ */

#include "hercules.h"
#include "opcode.h"
#include "inline.h"
#include "commadpt.h"

#if defined(FEATURE_EMULATE_VM)

#if !defined(_VM_C)
#define _VM_C

/*-------------------------------------------------------------------*/
/* Internal macro definitions                                        */
/*-------------------------------------------------------------------*/
#define DEV024(_type,_cls,_typ) \
       { _type,_cls,_typ,0xC0 }
#define DEV210(_type,_cls,_typ) \
       { _type,_cls,_typ,0x40 }

/*-------------------------------------------------------------------*/
/* Synchronous Block I/O Parameter List                              */
/*-------------------------------------------------------------------*/
typedef struct _HCPSBIOP {
        HWORD   devnum;                 /* Device number             */
        BYTE    akey;                   /* Bits 0-3=key, 4-7=zeroes  */
        BYTE    type;                   /* I/O request type          */
        FWORD   blksize;                /* Fixed block size          */
        FWORD   sbiaddr;                /* Address of SBILIST        */
        FWORD   sbicount;               /* Number of SBILIST entries */
        FWORD   blkcount;               /* Number of blocks processed*/
        BYTE    unitstat;               /* Device status             */
        BYTE    chanstat;               /* Subchannel status         */
        HWORD   residual;               /* Residual byte count       */
        BYTE    lpm;                    /* Logical path mask         */
        BYTE    resv1[5];               /* Reserved bytes, must be 0 */
        HWORD   sensecount;             /* Number of sense bytes     */
        BYTE    resv2[24];              /* Reserved bytes, must be 0 */
        BYTE    sense[32];              /* Sense bytes               */
    } HCPSBIOP;

/* Definitions for I/O request type */
#define HCPSBIOP_WRITE        0x01
#define HCPSBIOP_READ         0x02

/*-------------------------------------------------------------------*/
/* Synchronous General I/O Parameter List                            */
/*-------------------------------------------------------------------*/
typedef struct _HCPSGIOP {
        HWORD   devnum;                 /* Device number             */
        BYTE    akey;                   /* Bits 0-3=key, 4-7=zeroes  */
        BYTE    flag;                   /* Flags                     */
        FWORD   resv1;                  /* Reserved word, must be 0  */
        FWORD   ccwaddr;                /* Address of channel program*/
        FWORD   resv2;                  /* Reserved word, must be 0  */
        FWORD   lastccw;                /* CCW address at interrupt  */
        BYTE    unitstat;               /* Device status             */
        BYTE    chanstat;               /* Subchannel status         */
        HWORD   residual;               /* Residual byte count       */
        BYTE    lpm;                    /* Logical path mask         */
        BYTE    resv3[5];               /* Reserved bytes, must be 0 */
        HWORD   sensecount;             /* Number of sense bytes     */
        BYTE    resv4[24];              /* Reserved bytes, must be 0 */
        BYTE    sense[32];              /* Sense bytes               */
    } HCPSGIOP;

/* Bit definitions for flags */
#define HCPSGIOP_FORMAT1_CCW  0x80      /* 1=Format-1 CCW            */
#define HCPSGIOP_FLAG_RESV    0x7F      /* Reserved bits, must be 0  */

/*-------------------------------------------------------------------*/
/* DIAGNOSE X'24' and DIAGNOSE X'210' Structures and Table           */
/*-------------------------------------------------------------------*/

/* VM Device Class Definitions */
#define DC_TERM 0x80
#define DC_GRAF 0x40
#define DC_URI  0x20
#define DC_URO  0x10
#define DC_TAPE 0x08
#define DC_DASD 0x04
#define DC_SPEC 0x02
#define DC_FBA  0x01

/* VM Device Type Definitions */
#define DT_CTCA 0x80
#define DT_FBA  0x00
#define DT_OSA  0x20 /* Not yet supported */
#define DT_UNKN 0x01
#define DT_0671 0x20
#define DT_1052 0x00
#define DT_1403 0x41
#define DT_1442 0x88
#define DT_2305 0x02
#define DT_2311 0x80
#define DT_2314 0x40
#define DT_2501 0x81
#define DT_2703 0x40
#define DT_3211 0x42
#define DT_3215 0x00
#define DT_3277 0x04
#define DT_3287 0x02
#define DT_3310 0x01
#define DT_3330 0x10
#define DT_3340 0x01
#define DT_3350 0x08
#define DT_3370 0x02
#define DT_3375 0x04
#define DT_3380 0x20
#define DT_3390 0x82
#define DT_3410 0x08
#define DT_3420 0x10
#define DT_3422 0x82
#define DT_3430 0x02
#define DT_3480 0x01
#define DT_3490 0x81
#define DT_3505 0x84
#define DT_3525 0x84
#define DT_3590 0x83
#define DT_370x 0x40
#define DT_8809 0x04
#define DT_9332 0x08
#define DT_9335 0x04
#define DT_9336 0x40
#define DT_9345 0x81
#define DT_9347 0x84

/* VM Virtual Device Status Definitions */
#define DS_DED    0x01    /* Dedicated device          */
#define DS_BUSY   0x20    /* Device is busy            */

/* VM Virtual Device Flag Definitions */
#define DF_ENA     0x80   /* 270x line enabled         */
#define DF_CONN    0x40   /* 270x line connected       */
#define DF_RSRL    0x02   /* Reserve/Release supported */
#define DF_MIDAW   0x01   /* MIDAW's supported         */

/* VM Real Device Features */
#define DRF_RPS    0x80  /* Device has RPS             */
#define DRF_EXTSNS 0x40  /* Extended Sense             */
#define DRF_CTCA   0x40  /* CTCA device                */
#define DRF_35M    0x08  /* 3340 has 35M data module   */
#define DRF_70M    0x04  /* 3340 has 70M data module   */
#define DRF_RSRL   0x02  /* Reserve/Release valid      */

/*-------------------------------------------------------------------*/
/* Hercules-to-VM Device Table                                       */
/*-------------------------------------------------------------------*/
typedef struct _VMDEVTBL {
        U16     vmhtype;                /* Hercules device type      */
        BYTE    vmdevcls;               /* VM Device Class           */
        BYTE    vmdevtyp;               /* VM Device Type            */
        BYTE    vmdiags;                /* DIAGS recognizing device  */
#define VMDIAG024 0x80   /* Device recognized by DIAGNOSE X'24'      */
#define VMDIAG210 0x40   /* Device recognized by DIAGNOSE X'210'     */
    } VMDEVTBL;
#define VMDEV_SIZE sizeof(VMDEVTBL)

static VMDEVTBL vmdev[] = {
   DEV024(0x0671,DC_FBA, DT_0671),
   DEV024(0x1052,DC_TERM,DT_1052),
   DEV024(0x1403,DC_URO, DT_1403),
   DEV024(0x1442,DC_URI, DT_1442),
   DEV024(0x2305,DC_DASD,DT_2305),
   DEV024(0x2311,DC_DASD,DT_2311),
   DEV024(0x2314,DC_DASD,DT_2314),
   DEV024(0x2501,DC_URI, DT_2501),
   DEV024(0x2703,DC_TERM,DT_2703),
   DEV024(0x3088,DC_SPEC,DT_CTCA),
   DEV024(0x3211,DC_URI, DT_3211),
   DEV024(0x3215,DC_TERM,DT_3215),
   DEV024(0x3270,DC_GRAF,DT_3277),
   DEV024(0x3287,DC_GRAF,DT_3287),
   DEV024(0x3310,DC_FBA, DT_3310),
   DEV024(0x3330,DC_DASD,DT_3330),
   DEV024(0x3340,DC_DASD,DT_3340),
   DEV024(0x3350,DC_DASD,DT_3350),
   DEV024(0x3370,DC_FBA, DT_3370),
   DEV024(0x3375,DC_DASD,DT_3375),
   DEV024(0x3380,DC_DASD,DT_3380),
   DEV210(0x3390,DC_DASD,DT_3390),
   DEV024(0x3410,DC_TAPE,DT_3410),
   DEV024(0x3420,DC_TAPE,DT_3420),
   DEV024(0x3422,DC_TAPE,DT_3422),
   DEV024(0x3430,DC_TAPE,DT_3430),
   DEV024(0x3480,DC_TAPE,DT_3480),
   DEV210(0x3490,DC_TAPE,DT_3490),
   DEV024(0x3505,DC_URI, DT_3505),
   DEV024(0x3525,DC_URO, DT_3525),
   DEV024(0x3590,DC_TAPE,DT_3590),
   DEV024(0x3705,DC_SPEC,DT_370x),
   DEV024(0x8809,DC_TAPE,DT_8809),
   DEV024(0x9332,DC_FBA, DT_9332),
   DEV024(0x9335,DC_FBA, DT_9335),
   DEV024(0x9336,DC_FBA, DT_9336),
   DEV210(0x9345,DC_DASD,DT_9345),
   DEV024(0x9347,DC_TAPE,DT_9347)
};
#define VMDEV_NUM (sizeof(vmdev)/VMDEV_SIZE)

/*-------------------------------------------------------------------*/
/* Virtual Device Data                                               */
/*-------------------------------------------------------------------*/
typedef struct _VRDCVDAT {
        BYTE    vdevcls;                /* Virtual device class      */
        BYTE    vdevtyp;                /* Virtual device type       */
        BYTE    vdevstat;               /* Virtual device status     */
        BYTE    vdevflag;               /* Virtual device flag       */
    } VRDCVDAT;

/*-------------------------------------------------------------------*/
/* Real Device Data                                                  */
/*-------------------------------------------------------------------*/
typedef struct _VRDCRCDT {
        BYTE    rdevcls;                /* Real device class         */
        BYTE    rdevtyp;                /* Real device type          */
        BYTE    rdevmodl;               /* Real device model         */
        BYTE    rdevfeat;               /* Real device features      */
    } VRDCRCDT;

/*-------------------------------------------------------------------*/
/* Virtual/Real Device Characteristics Block                         */
/*-------------------------------------------------------------------*/
typedef struct _VRDCBLOK {
/*00*/  HWORD    vrdcdvno;       /* Device number                    */
/*02*/  HWORD    vrdclen;        /* VRDCBLOK length                  */
/*04*/  VRDCVDAT vrdcvdat;       /* Virtual device data              */
/*08*/  VRDCRCDT vrdcrcdt;       /* Real device data                 */
/*0C*/  BYTE     vrdcundv;       /* Real underlying device           */
/*0D*/  BYTE     vrdcrdaf;       /* Real device additional features  */
#define VRDCEMRD 0x02            /* No emulated real device          */
/*0E*/  HWORD    vrdcrsvd;       /* Reserved - must be zeros         */
/*10*/  BYTE     vrdcrdc[64];    /* READ DEVICE CHARACTERISTICS data */
/*50*/  BYTE     vrdcpgid[11];   /* Path Group Identifier            */
/*5B*/  BYTE     resv5[5];       /* reserved                         */
/*60*/  BYTE     vrdcvers;       /* version                          */
/*61*/  BYTE     vrdcrsio[31];   /* reserved for Input/Output        */
/*80*/  HWORD    vrdcrdev;       /* Real device number               */
/*82*/  BYTE     vrdcrsve[126];  /* reserverd                        */
/*100*/
   } VRDCBLOK;
#define VRDCBLOK_SIZE sizeof(VRDCBLOK)

#endif /*!defined(_VM_C)*/

/*-------------------------------------------------------------------*/
/* Internal Function Prototypes                                      */
/*-------------------------------------------------------------------*/
DEVBLK* ARCH_DEP(vmdevice_data)(int, U16, VRDCVDAT *, VRDCRCDT *);

/*-------------------------------------------------------------------*/
/* Provide VM Virtual and Real Device Data based upon device number  */
/*-------------------------------------------------------------------*/
DEVBLK* ARCH_DEP(vmdevice_data)(int code, U16 devnum, VRDCVDAT *vdat, VRDCRCDT *rdat)
{
U32      i;                      /* loop index                      */
VMDEVTBL *vmentry;               /* -> VMDEVTBL entry found         */
DEVBLK   *dev;                   /* -> DEVBLK                       */

    /* Clear vdat and rdat */
